Revit 2024 API
MEPNetworkSegmentData Constructor
Overload List
Name | Description
MEPNetworkSegmentData()
 Creates a default segment data object.
MEPNetworkSegmentData(MEPNetworkSegmentData)
 Creates a new segment data object based on another object.
See Also
MEPNetworkSegmentData Class
MEPNetworkSegmentData Members
Autodesk.Revit.DB.Analysis Namespace